% Створення координат прямокутних трикутників танграму
t1 = [0 0; 0 1; 1 0]; % трикутник 1
t2 = [0 0; 0 1; 1 1]; % трикутник 2
t3 = [0 0; 1 0; 1 -1]; % трикутник 3
t4 = [0 1; 1 1; 0 2]; % трикутник 4
t5 = [1 1; 1 0; 2 1]; % трикутник 5

% Створення координат квадрата та паралелограму танграму
s = [0 0; 0 2; 2 2; 2 0]; % квадрат
p = [1 1; 2 2; 3 1; 2 0]; % паралелограм

% Побудова танграм-фігур за допомогою команди patch()
figure;
subplot(2,3,1);
patch(t1(:,1), t1(:,2), 'r');
axis equal;
subplot(2,3,2);
patch(t2(:,1), t2(:,2), 'g');
axis equal;
subplot(2,3,3);
patch(t3(:,1), t3(:,2), 'b');
axis equal;
subplot(2,3,4);
patch(t4(:,1), t4(:,2), 'c');
axis equal;
subplot(2,3,5);
patch(t5(:,1), t5(:,2), 'm');
axis equal;
subplot(2,3,6);
patch(s(:,1), s(:,2), 'y');
hold on;
patch(p(:,1), p(:,2), 'k');
axis equal;
